cases/convergence_study/mesh2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  v2106                                 |
  |   \\  /    A nd           | Website:  www.openfoam.com                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
 (0 0 0)    //0
 (1.0 0 0)  //1
 (1.0 1.0 0) //2
 (0 1.0 0)  //3
 (0 0 0.0015) //4
 (1.0 0 0.0015) //5
 (1.0 1.0 0.0015) //6
 (0 1.0 0.0015) //7
 (1.03 0 0)
 (1.03 1.0 0)
 (1.03 0 0.0015)
 (1.03 1.0 0.0015)
 (2.03 0 0)
 (2.03 1.0 0)
 (2.03 0 0.0015)
 (2.03 1.0 0.0015)
 );

//fg #calc "1/2";

blocks
(
 hex (0 1 2 3 4 5 6 7) (250 250 1) simpleGrading ( 0.25 12 1)
 hex (1 8 9 2 5 10 11 6) (16 250 1) simpleGrading (1 12 1)
 hex (8 12 13 9 10 14 15 11) (250 250 1) simpleGrading (4 12 1)
 );

edges
(
);

boundary
(
 frontAndBack
 {
   type empty;
   faces
     (
      (4 5 6 7)
      (5 10 11 6)
      (10 14 15 11)
      (0 3 2 1)
      (1 2 9 8)
      (8 9 13 12)
      );
 }
 walls
 {
   type wall;
   faces
     (
      (0 1 5 4)
      (8 12 14 10)
      );
 }
    
 drop
 {
   type patch;
   faces
     (
      (1 8 10 5)
      );
 }
 air
 {
   type patch;
   faces
     (
      (0 4 7 3)
      (3 7 6 2)
      (2 6 11 9)
      (9 11 15 13)
      (13 15 14 12)
      );
 }

 );

mergePatchPairs
(
);

// ************************************************************************* //
