cases/convergence_study/mesh2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver              GAMG;
        tolerance           1e-8;
        relTol              0;
        smoother            symGaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|C)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          1e-3;
//        maxIter         100;
    }

    T
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.01;
    }

    "(U|C)Final"
    {
        $U;
        relTol          0;
    }

//    Ii
//    {
//        solver              GAMG;
//        tolerance           1e-4;
//        relTol              0;
//        smoother            symGaussSeidel;
//        cacheAgglomeration  true;
//        nCellsInCoarsestLevel   10;
//        agglomerator        faceAreaPair;
//        mergeLevels         1;
//        maxIter             5;
//        nPreSweeps          0;
//        nPostSweeps         1;
//    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 10; // for pimple.loop
    nCorrectors     3; // for pressure solution
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;


    residualControl
    {
        U
        {
            relTol 1e-3;
            tolerance 1e-8;
        }
        p_rgh
        {
            relTol 0;
            tolerance 1e-8;
        }

        "(U|C)Final"
        {
            $U;
            relTol          0;
        }
    }


}


// ************************************************************************* //
