cases/convergence_study/mesh2/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // actuationDisk1
    {
        name    expMeasurementSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.0955 0 0) (0.1065 0.0105765 0.00015);
    }
    {
        name    expMeasurementZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     expMeasurementSet;
    }

);


// ************************************************************************* //
